Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/attendance_and_discipline_in_schools/school_attendance.html.txt.tmx
Source language: en
Languages: ga

source: The legislation governing school attendance in Ireland is the Education (Welfare) Act 2000
ga: Sé an tAcht Oideachais (Leas) 2000 a rialaíonn tinreamh scoile in Éirinn

source: Under the Act the minimum school leaving age is raised to 16 years (was 15), or the completion of three years of post-primary education, whichever is the later
ga: Ardaíodh an íosaois fágála scoile san Acht go 16 bliana (15 cheana), nó críochnú trí bliana oideachais iar-bhunscoile, pé ceann is deireanaí

source: Parents are required to ensure that their children from the age of 6 to the age of 16 attend a recognised school or receive a certain minimum education
ga: Ní mór do thuismitheoirí a chinntiú go bhfreastalóidh a gcuid gasúr ar scoil aitheanta ó aois a 6 go 16, é sin nó go bhfaighidh siad íosleibhéal áirithe oideachais

source: There is no absolute legal obligation on children to attend school nor on their parents to send them to school
ga: Níl aon oibligeáid chinnte de réir dlí ar ghasúir freastal ar scoil ná ar a dtuismitheoirí iad a chur ar scoil

source: Article 42 of Bunreacht na hÉireann (the Constitution) acknowledges that the primary and natural educator of the child is the family and guarantees to respect the right and duty of parents to provide, according to their means, for the religious and moral, intellectual, physical and social education of their children
ga: Aithníonn Alt a 42 de Bhunreacht na hÉireann gur leis an teaghlach ó nádúr oideachas a chur ar ghasúr agus géilleann sé do cheart agus do dhualgas na dtuismitheoirí oideachas creidimh agus morálta a sholáthar dá gclann, de réir a n-acmhainní, chomh maith le h-oideachas intleachtúil, corpartha agus sóisialta

source: Parents are free to provide this education in their homes or in schools recognised or established by the State
ga: Tá cead ag tuismitheoirí an t-oideachas seo a chur ar fáil sa bhaile nó i scoileanna atá bunaithe nó aitheanta ag an Stát

source: The Child and Family Agency
ga: An Ghníomhaireacht um Leanaí agus an Teaghlach

source: The Child and Family Agency's (CFA) is the national agency responsible to ensure that every child attends school regularly, or otherwise receives an appropriate minimum education
ga: Is áisínteacht náisiúnta í an Ghníomhaireacht um Leanaí agus an Teaghlach a bunaíodh le deimhin a dhéanamh de go bhfreastalóidh gach gasúr ar scoil go rialta nó go bhfaighidh sé nó sí íosleibhéal sásúil oideachais ar bhealach éigin eile

source: It also advises the Government on school attendance and education provision
ga: Chomh maith leis sin cuireann sé comhairle ar an Rialtas faoi thinreamh scoile agus soláthar oideachais

source: The Agency's emphasis is on helping schools, families and children, rather than imposing penalties for non-attendance at school
ga: Is mó an bhéim a leagann an Ghníomhaireacht um Leanaí agus an Teaghlach ar chúnamh a thabhairt do scoileanna, do theaghlaigh agus do ghasúir, ná ar phionós a ghearradh de bharr neamhthinreamh scoile

source: It employs educational welfare officers at local level throughout the country to provide support and advice to parents and schools and to follow up on absences from school
ga: Tá oifigigh leasa oideachais fostaithe go háitiúil ar fud na tíre le cúnamh agus comhairle a thabhairt do thuismitheoirí is scoileanna agus le neamhthinreamh scoile a fhiosrú

source: They also help to co-ordinate all policies concerning attendance and educational welfare
ga: Chomh maith leis sin cuidíonn siad le beartais faoi thinreamh scoile agus leas oideachais a chomhordú

source: The Agency's remit includes responsibility for the Home School Community Liaison Scheme, the School Completion Programme and the Educational Welfare Sevice (EWS)
ga: Tá an Ghníomhaireacht um Leanaí agus an Teaghlach freagrach as clár Tacaíochta Scoile comhordanáidithe amháin lena mbaineann An Scéim Teagmhála Baile Scoile agus an Phobail (STBSP), an Clár um

source: • Monitors school attendance, and takes a range of measures where children do not attend school
ga: • Monatóireacht ar thinreamh scoile agus leanann sé beartais áirithe le déaláil le gasúir nach bhfreastalaíonn ar scoil

source: • Maintains a register of children who are not attending a recognised school
ga: • Coinníonn sé clárliosta de ghasúir nach bhfreastalaíonn ar scoil aitheanta

source: • Maintains a register of young persons of 16 and 17 years of age who leave school early to take up employment and makes arrangements for their continuing education and training in consultation with providers and employers
ga: • Coinníonn sé clárliosta de ógánaigh 16 agus 17 bliain d'aois a stopann ón scoil go luath le dul ag saothrú agus socraíonn sé cúrsaí scolaíochta is oiliúna dóibh i gcomhar lena bhfostóirí

source: • Collects data on school attendance and non-attendance, suspensions and expulsions
ga: • Cruinníonn sé sonraí faoi thinreamh is neamhthinreamh scoile, agus faoi dhaltaí a chuirtear ar fionraí nó a dhíbrítear ón scoil

source: • Intervenes in relation to proposed school expulsions
ga: • Déanann sé idirghabháil má bhíonn dalta le díbirt ón scoil

source: It publishes reports on school attendance at primary and post primary schools
ga: Foilsíonn an BNLO tuairiscí faoi thinreamh scoile ar bhunscoileanna agus iar-bhunscoileanna

source: Schools are obliged to keep a register of the students attending the school
ga: Caithfidh scoileanna clárliosta tinrimh dá gcuid daltaí a choinneáil

source: They must also maintain attendance records for all students and inform the Child and Family Agency's educational welfare services if a child is absent for more than 20 days in a school year
ga: Caithfidh siad clárliostaí tinrimh dá gcuid daltaí uile a choinneáil agus má bhíonn dalta níos mó ná 20 lá as láthair é sin a chur in iúl don an Ghníomhaireacht um Leanaí agus an Teaghlach

source: The principal must also inform the Child and Family Agency's educational welfare services if, in his/her view, a student has an attendance problem
ga: Má cheapann an príomhoide go bhfuil fadhb thinrimh ag dalta caithfidh sé/sí é sin a chur in iúl don Ghníomhaireacht um Leanaí agus an Teaghlach

source: This could arise if the student is not coming to school or if the student is suspended
ga: Bheadh cás mar seo i gceist mura mbeadh dalta ag freastal nó dá mbeadh sé ar fionraí

source: You can fin more information about school discipline
ga: Is féidir leat tuilleadh a léamh faoi smacht scoile anseo

source: Schools can make returns to the the Agency online
ga: Tá eolas faoi fhilleachán tinrimh a sheoladh ar an idirlíon

source: The Board of Management in each school is obliged to prepare a school attendance strategy and submit it to the Agency
ga: Ní mór don Bhord Bainistíochta i ngach scoil straitéis thinreamh scoile a réiteach agus a chur faoi bhráid an Ghníomhaireacht um Leanaí agus an Teaghlach

source: This strategy will encourage, in a positive way, regular school attendance and an appreciation of learning within the school and will provide for:
ga: Cothóidh an straitéis seo, ar bhealach dearfach, freastal rialta ar scoil agus meas ar an bhfoghlaim inti agus cuideoidh sí le:

source: • The rewarding of students who have good attendance records
ga: • Duaiseanna a thabhairt do scoláirí a mbíonn tinreamh maith acu

source: • The identification of students who are at risk of dropping out at an early stage
ga: • Scoláirí atá i mbaol stopadh ón scoil go luath a aithint

source: • The establishment of closer contacts between the school and the families concerned
ga: • Teagmháil níos fearr idir scoileanna agus teaghlaigh na scoláirí sin a chothú

source: • The co-ordination with other schools of programmes aimed at promoting good behaviour and encouraging attendance
ga: • Dul i gcomhar le scoileanna eile d'fhonn dea-iompar agus dea-thinreamh a chothú

source: • The identification of aspects of the operation and management of the school and of the curriculum that may contribute to truancy and the removal of those aspects in so far as they are not necessary for the proper running of the school
ga: • Gnéithe de mhodhanna oibre, de bhainistiú agus de churaclam na scoile a chothódh neamhláithreacht a aithint agus fáil réidh le aon ghné acu nach dteastaíonn leis an scoil a rith i gceart

source: With the consent of the parents, the Child and Family Agency may arrange for an examination of the intellectual, emotional or physical development of a child
ga: Le cead ó na thuismitheoirí féadfaidh an Ghníomhaireacht um Leanaí agus an Teaghlach gasúr a chur lena fhorbairt intleachtúil, mhothúchánach nó chorpartha a mheas

source: If the parent refuses consent, the Agency may apply to the Circuit Court for an order that the examination be carried out
ga: Má dhiúltaíonn an tuismitheoir an cead seo a thabhairt, féadfaidh an Ghníomhaireacht um Leanaí agus an Teaghlach iarraidh ar an gCúirt Chuarda an scrúdú seo a ordú

source: The Circuit Court may grant the order if it is satisfied that the child's behaviour, lack of educational progress or regular absence from school without a reasonable excuse warrants an examination
ga: Féadfaidh an Chúirt Chuarda an t-ordú cuí a dhéanamh má cheapann an breitheamh go dteastaíonn an scrúdú mar gheall ar iompar an ghasúir, a easpa dul chun cinn go hoideachasúil nó a asláithreacht rialta ón scoil gan údar maith

source: Responsibilities and duties of parents
ga: Cúraimí agus dualgaisí tuismitheoirí

source: Under the Education Welfare Act 2000 parents must inform the school if their children will be absent from school on a school day and the reason for the absence, for example, illness
ga: De réir an Acht Leasa Oideachais 2000 caithfidh tuismitheoirí a chur in iúl roimh ré don scoil má bhíonn gasúr leo le bheith ón scoil lá scoile agus údar na hasláithreachta a lua, mar shampla, tinneas

source: It is best to do this in writing
ga: Moltar é seo a dhéanamh i scríbhinn

source: The Child and Family Agency strongly advises against taking children out of school to go on holiday during term-time
ga: Cuireann an Ghníomhaireacht um Leanaí agus an Teaghlach comhairle do thuismitheoirí nach rud maith é laethanta saoire a thógáíl i rith an tearma scoile

source: Parents and guardians have a legal obligation to ensure that their child attends a school or otherwise receives an education
ga: Tá dualgas reachtúil ar thuismitheoirí agus ar chaomhnóirí a chinntiú go ngabhfaidh a ngasúir ar scoil nó go gcuirtear oideachas orthu ar bhealach eile

source: If the Agency considers that a parent is failing in his or her obligation, it must send the parent a School Attendance Notice warning that legal action would follow if the child did not attend school regularly
ga: Má cheapann an Ghníomhaireacht um Leanaí agus an Teaghlach go bhfuil ag teip ar thuismitheoir an dualgas seo a chomhlíonadh caithfidh sé Fógra Tinreamh Scoile a chur chuig an tuismitheoir go mbeidh cás cúirte ann mura bhfreastalaíonn an gasúr ar scoil go rialta

source: Before doing this, it must make reasonable efforts to consult with the parents and the child
ga: Ba chóir dó chuile iarracht réasúnta a dhéanamh roimh ré le labhairt leis na tuismitheoirí agus leis an ngasúr

source: If the parent fails to comply, he or she may be prosecuted
ga: Mura dtugann tuismitheoir aird ar chomhairle is féidir an dlí a chur air

source: If convicted, the parent may be fined €634.87 and/or imprisoned for a month and fined €253.95 for each subsequent day that he or she fails to send the child to school
ga: Má chiontaítear an tuismitheoir d'fhéadfaí fíneáil €634.87 agus/nó mí i bpríosún a ghearradh air agus fíneáil €253.95 in aghaidh gach lá ina dhiaidh sin nach gcuirtear an gasúr ar scoil

source: If the parent claims that suitable alternative education is being provided, he or she must prove this
ga: Má mhaíonn an tuismitheoir go bhfuil oideachas feiliúnach eile á fháil is leis/léi é sin a chruthú

source: It will be a defence for the parents to show that they have made all reasonable efforts to send the child to school - in such cases, the Child and Family Agency must be informed
ga: Má léiríonn na tuismitheoirí go ndearna siad chuile iarracht réasúnta leis an ngasúr a chur ar scoil glacfar leis sin mar leithscéal, agus i gcás mar seo ní mór tuairisc a chur ag an bhFeidhmeanneacht Seirbhíse Sláinte (FSS)

source: The leaflet for parents Don't let your child miss out is available in 18 languages
ga: Tá an bileog, Ná bíodh do leanbhsa thíos leis (pdf) ar fáil ón Ghníomhaireacht um Leanaí agus an Teaghlach i 18 dteanga

source: Education outside the school system
ga: Oideachas taobh amuigh den chóras scoile

source: The Minister may prescribe minimum standards of education for those educated outside the recognised school system
ga: Féadfaidh an tAire íoschaighdeáin oideachais a shocrú dóibh sin a fhaigheann oideachas lasmuigh den chóras aitheanta scolaíochta

source: The Child and Family Agency is obliged to maintain a register of children who are receiving education but not attending a recognised school
ga: Ní mór don Ghníomhaireacht um Leanaí agus an Teaghlach clárliosta a choinneáil de na gasúir atá ag fáil oideachais ach nach bhfreastalaíonn ar scoil aitheanta

source: In effect, this register will show the names of children who are being educated at home or in a non-recognised school - it is not a register of school dropouts
ga: Séard a bhéas sa liosta seo ná ainmneacha gasúr atá ag fáil a gcuid oideachais sa mbaile nó i scoil nach scoil aitheanta í - ní liosta luathfhágáilithe é

source: Parents whose children are not attending a recognised school must register their child with the Agency
ga: Tuismitheoirí nach gcuireann a gclann ar scoil aitheanta, caithfidh siad iad a chlárú leis an Ghníomhaireacht um Leanaí agus an Teaghlach

source: If the parent agrees, the Agency will then investigate the educational arrangements that have been made for the child and judge whether or not the child is receiving the prescribed minimum education
ga: Le cead ón tuismitheoir, scrúdóidh an Ghníomhaireacht um Leanaí agus an Teaghlach na socruithe oideachais a rinneadh don ghasúr lena dheimhniú go bhfuil sé ag fáil an íosmhéid scolaíochta atá ordaithe

source: If the Agency is satisfied, it may enter the child's name on the register
ga: Má bhíonn an Ghníomhaireacht um Leanaí agus an Teaghlach sásta is féidir ainm an ghasúir a chur ar an liosta

source: If the Child and Family Agency is not satisfied, it may either:
ga: Mura mbíonn an Ghníomhaireacht um Leanaí agus an Teaghlach sásta, féadfaidh sé

source: • Require the parents to comply with its requirements in order to ensure that the child receives the prescribed minimum education and then register the child, or
ga: • Iachall a chur ar na tuismitheoirí na socraithe cuí a dhéanamh le íosmhéid oideachais a chur ar an ngasúr agus ansin é a chlárú, nó

source: • Refuse to register the child
ga: • Gan é a chlárú

source: There are also provisions for removing a child's name from the register
ga: Tá coinníollacha leagtha síos freisin le ainm gasúir a bhaint den chlárliosta

source: Obligation to attend school
ga: Dualgas freastal ar scoil

source: Parents do not have to send their children to a recognised school if:
ga: Níl ar thuismitheoirí a ngasúir a chur ar scoil aitheanta más rud é:

source: • The child is on the register described above
ga: • Go bhfuil an gasúr ar an gclárliosta a luaitear thuas

source: • Parents have made an application have their child included on the register but a decision has not been made or an appeal is pending
ga: • Go bhfuil iarratas déanta ag tuismitheoirí leis an ngasúr a chur ar an liosta ach nach bhfuil cinneadh déanta fós nó go bhfuil achomharc fós le déanamh

source: • The child is being educated outside the state
ga: • Go bhfuil gasúr ag fáil oideachais taobh amuigh den stát

source: • There is a good reason for the child not attending school
ga: • Go bhfuil údar maith ann gan an gasúr a chur ar scoil

source: If the Child and Family Agency refuses to register a child, or requires an undertaking from a parent or removes a child from the register, the parent may appeal to the Minister
ga: Má dhiúltaíonn an Ghníomhaireacht um Leanaí agus an Teaghlach gasúr a chlárú, nó má éilíonn sé gealltanas ar thuismitheoir, nó má bhaineann sé gasúr den chlárliosta, féadfaidh an tuismitheoir achomharc a dhéanamh leis an Aire

source: The Minister will appoint an appeal committee, which may decide to register the child, refuse to register the child or require an undertaking
ga: Ceapfaidh an tAire coiste achomhairc. Féadfaidh an coiste an gasúr a chlárú, nó gan é a chlárú nó gealltanas a éileamh

source: Where no appeal is brought, the Agency must make every reasonable effort to have the child in question enrolled in another school
ga: Mura ndéantar achomharc, caithfidh an Ghníomhaireacht um Leanaí agus an Teaghlach chuile iarracht a dhéanamh an gasúr a chur ar rolla scoil éigin eile

source: If this fails, the Agency must ensure that the child receives a prescribed minimum education
ga: Mura n-éiríonn leis, caithfidh an Ghníomhaireacht um Leanaí agus an Teaghlach a chinntiú go bhfaighidh an gasúr an t-íosmhéid oideachais atá ordaithe

source: Parents who are having difficulties ensuring their children’s attendance at school can contact an Child and Family Agency's educational welfare services educational welfare officer for advice and help with this
ga: Tuismitheoirí a bhfuil deacrachtaí acu ag iarraidh a gclann a chur ar scoil, féadfaidh siad teagmháil le oifigeach leasa oideachais de chuid an Ghníomhaireacht um Leanaí agus an Teaghlach le comhairle agus cúnamh a fháil. Seo liosta de na hoifigigh leasa oideachais
